#Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки.
# Храната се пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв,
# а опаковка храна за котки струва 4 лв.

#От конзолата се четат 2 реда:

#Броят на опаковките храна за кучета – цяло число в интервала [0… 100]

#Броят на опаковките храна за котки –  цяло число в интервала [0… 100]

#Изход

#На конзолата се отпечатва:

#"{крайната сума} lv."

#Примерен вход и изход

Dog_food_count = int(input())
Cat_food_count = int(input())


Dog_food = 2.50 * Dog_food_count
Cat_food = 4.00 * Cat_food_count

Total = Dog_food + Cat_food

print(Total, 'lv.')