# Вход
# От конзолата се четат по два реда до въвеждане на команда "END", ако са минали повече от 5 дни в
# изкачване или се достигне върха (8 848м):
#  "Yes" / "No" - текст - дали Атанас ще нощува преди изкачването на следващите метри или не
#  Изкачени метри - цяло число в интервала [1...4000]

# Изход
# След получаване на командата "END", превишаване на разрешениете 5 дни за изкачване или се достигне върха
# (8 848м), на конзолата се отпечатва:
#  Ако Атанас е изкачил Еверест:
# "Goal reached for {брой дни които Атанас е изкачвал върха} days!"
#  Ако Атанас НЕ е изкачил Еверест:
# "Failed!"
# "{достигнатите от Атанас метри}"

meters = 5364
days = 1
while days < 5:
    sleep = str(input())
    if sleep == 'END':
        break
    if sleep == 'No':
        days -= 1
    days += 1
    if days == 6:
        break
    meters_input = float(input())
    meters = meters + abs(meters_input)
    if meters >= 8848:
        break

if meters >= 8848:
    print(f'Goal reached for {abs(days)} days!')
else:
    print(f'Failed!')
    print(f'{int(abs(meters))}')
