# Група приятели отиват на екскурзия. Първоначално прочитаме от конзолата броя на хората в групата. След
# това на отделни редове получаваме броя на нощувките, картите за транспорт и билети за музеи, които ще
# бъдат закупени от един човек. Трябва да се има предвид следния ценоразпис:
#  Нощувка - 20 лв.
#  Карта за транспорт - 1.60 лв.
#  Билет за музей - 6 лв.
# Към крайната сума се начислява допълнително 25% за непредвидени разходи. Да се напише програма,
# която изчислява общата сумата, която групата трябва да плати.
# Вход:
# От конзолата се четат 4 реда:
# 1. Броят на хората в групата – цяло число в интервала [0 … 50]
# 2. Броят на нощувките – цяло число в интервала [0 … 2000]
# 3. Броят на картите за транспорт – цяло число в интервала [0… 2000]
# 4. Броят на билетите за музеи – цяло число в интервала [0 … 2000]


night = 20
ride = 1.60
museum = 6

peoples = int(input())
night_stay = int(input())
transport_cards = int(input())
tickets_museum = int(input())

stay_price = night_stay * night
transport_price = transport_cards * ride
exploration = tickets_museum * museum

total = (stay_price + transport_price + exploration) * peoples
total = total + (total * 0.25)

print(f'{total:.2f}')


