# Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка.
# Напишете програма, която изчислява какви разходи ще има Джеси,
# ако започне да тренира,
# като знаете колко е таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка:
#     • Баскетболни кецове – цената им е 40% по-малка от таксата за една година
#     • Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
#     • Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
#     • Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
# Вход
# От конзолата се четe 1 ред:
#     • Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]

yearly_fee = float(input())

shoes = yearly_fee * (60 / 100)
outfit = shoes * (80 / 100)
ball = outfit * (25 / 100)
accessories = ball * (20 / 100)

total_cost = yearly_fee + shoes + outfit + ball + accessories

print(total_cost)
