# Ресторант отваря врати и предлага няколко менюта на преференциални цени:
#     • Пилешко меню –  10.35 лв.
#     • Меню с риба – 12.40 лв.
#     • Вегетарианско меню  – 8.15 лв.
# Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
# Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
# Цената на доставка е 2.50 лв и се начислява най-накрая.
# Вход
# От конзолата се четат 3 реда:
#     • Брой пилешки менюта – цяло число в интервала [0 … 99]
#     • Брой менюта с риба – цяло число в интервала [0 … 99]
#     • Брой вегетариански менюта – цяло число в интервала [0 … 99]

menu_chicken_price = 10.35
menu_fish_price = 12.40
menu_veg_price = 8.15

menu_chicken = int(input()) * menu_chicken_price
menu_fish = int(input()) * menu_fish_price
menu_veg = int(input()) * menu_veg_price

food_without_dec = menu_chicken + menu_fish + menu_veg
total_cost = (food_without_dec * (20/100))+food_without_dec + 2.50

print(f'{total_cost:.5}')

