# Ако броя на видеокартите е по-голям от този на процесорите получава 15% отстъпка от крайната сметка.
# Важат следните цени:
#     • Видеокарта – 250 лв./бр.
#     • Процесор – 35% от цената на закупените видеокарти/бр.
#     • Рам памет – 10% от цената на закупените видеокарти/бр.
# Да се изчисли нужната сума за закупуване на материалите и да се пресметне дали бюджета ще му стигне.
# Вход
# Входът се състои от четири реда:
#     1. Бюджетът на Петър - реално число в интервала [1.0…100000.0]
#     2. Броят видеокарти - цяло число в интервала [1…100]
#     3. Броят процесори - цяло число в интервала [1…100]
#     4. Броят рам памет - цяло число в интервала [1…100]
# Изход
# На конзолата се отпечатва 1 ред, който трябва да изглежда по следния начин:
#     • Ако бюджета е достатъчен:
# "You have {остатъчен бюджет} leva left!"
#     • Ако сумата надхвърля бюджета:
# "Not enough money! You need {нужна сума} leva more!"


budget = float(input())
gpu = int(input())
cpu = int(input())
ram = int(input())

gpu_price = gpu * 250
cpu_price = cpu * (gpu_price*(35/100))
ram_price = ram * (gpu_price*(1/10))
total = gpu_price + cpu_price + ram_price

if gpu > cpu:
    total = total-total*(15/100)

if total <= budget:
    print(f"You have {abs(total-budget):.2f} leva left!")
else:
    print(f"Not enough money! You need {abs(total-budget):.2f} leva more!")


