# На конзолата се въвежда рекордът в секунди, който Иван трябва да подобри,
# разстоянието в метри, което трябва да преплува и времето в секунди, за което плува разстояние от 1 м.
# Да се напише програма, която изчислява дали се е справил със задачата,
# като се има предвид, че: съпротивлението на водата го забавя на всеки 15 м. с 12.5 секунди.
# Когато се изчислява колко пъти Иванчо ще се забави, в резултат на съпротивлението на водата,
# резултатът трябва да се закръгли надолу до най-близкото цяло число.
# Да се изчисли времето в секунди, за което Иванчо ще преплува разстоянието и разликата спрямо Световния рекорд.
# Вход
# От конзолата се четат 3 реда:
#     1. Рекордът в секунди – реално число;
#     2. Разстоянието в метри – реално число;
#     3. Времето в секунди, за което плува разстояние от 1 м. - реално число.
# 100

pwr = float(input())    # previous world record
distance = float(input())
tfm = float(input())    # time (seconds) for 1 meter

resistance = distance // 15

his_time = distance * tfm + 12.5 * resistance

if pwr <= his_time:
    his_time = his_time - pwr
    print(f'No, he failed! He was {abs(his_time):.2f} seconds slower.')
else:
    print(f" Yes, he succeeded! The new world record is {abs(his_time):.2f} seconds.")

